# -*- coding: utf-8 -*-

# ***********************************************
#          Имя файла
#         Test_1_YourFamilyName.py
#
#     Вы должнв выслать файл  по адресу
#     eabashkov@i.ua
#     до     часов     08.04.2020
#
# ***********************************************

"""
ШАБЛОН СКРИПТА ОТВЕТОВ НА ТЕСТОВЫЕ ЗАДАНИЯ

Группа КН-18
Студент  XXXXXX   YYYYYY    (Фамилия, Имя)

Дата: 08.04.2020

"""
# **********TASK 1 *************************************
def rearrange_tuple (tupin: tuple) -> tuple:
    """
        Возвращает три элемента  из  tupin
    """
    # Сюда свой код
    return

# **********TASK 2 *************************************
def frst_wrd(text: str) -> str:
    """
        Возвращает первое слово из входного text
    """
    # Сюда свой код
    return

# **********TASK 3 *************************************
def invers_str_word(text: str) -> str:
    """
        Возвращает каждое слово из text на своем месте но
        буквы в инвесном порядке

    """
    # Сюда свой код
    return


# **********TASK 4 *************************************
def all_equal(lst: list) -> bool:
    """
        Возвращает True, если все элементы lst одинаковые
        Возвращает False, в протвном случае

    """
    # Сюда свой код
    return


# **********TASK 5 *************************************
def list_compare(lst1: list, lst2: list ):
    """
        Возвращает список /  целое в соответствии с вариантом

    """
    # Сюда свой код
    return



# **********TASK 6 *************************************
def store_info(lst: list, Nc: int ) -> list:
    """
        Возвращает список словарей в соответствии с вариантом

    """
    # Сюда свой код
    return



# ТЕСТИРОВАНИЕ
if __name__ == '__main__':
    print('Студент ФИО') # Печать имени и фамилии студента
