# -*- coding: utf-8 -*-

# ***********************************************
#          Имя файла
#         Test_1_YourFamilyName.py
#
#     Вы должнв выслать файл  по адресу
#     eabashkov@i.ua
#     до     часов     08.04.2020
#
# ***********************************************

"""
ШАБЛОН СКРИПТА ОТВЕТОВ НА ТЕСТОВЫЕ ЗАДАНИЯ

Группа КН-18
Студент  XXXXXX   YYYYYY    (Фамилия, Имя)

Дата: 08.04.2020

"""
# **********TASK 1 *************************************
def 

# **********TASK 2 *************************************
def 

# **********TASK 3 *************************************
def 

# **********TASK 4 *************************************
def 

# **********TASK 5 *************************************
def 

# **********TASK 6 *************************************
def 

# ТЕСТИРОВАНИЕ
if __name__ == '__main__':
    print('Студент ФИО') # Печать имени и фамилии студента
